{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi there", "How are you", "Is anyone there?", "Hello", "Good day", "Howdy", "Hello there", "What's up", "How you doin?"],
         "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
         "context": [""]
        },
        {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time", "Later", "Farewell", "Have a good day", "Talk to you later", "I'm off"],
         "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
         "context": [""]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me", "Much appreciated", "Thank you very much", "My sincere gratitude", "Please accept my deepest thanks", "Thank you so much"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"],
         "context": [""]
        },
        {"tag": "noanswer",
         "patterns": ["abcxyz", "qwerty", "12343514", "fgaawer", "dfgdfasg", "7908789", "afgsagfasf", "ytrrs", "iytfuyj", "uoiugkghg"],
         "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
         "context": [""]
        },
        {"tag": "more_info",
         "patterns": ["Can you please tell me more?", "In details, please.", "I would like to know more of this matter.", "I need some info", "Can you tell some more info", "I'd like to know more details", "I'd appreciate more details", "More info would be nice", "It would be nice to receive more info", "I'd like to know more info"],
         "responses": ["Sure, but can you be more specific on what type of info?", "What aspect would you like to know more about?", "Can you be more specific in which type of info you want to find out?"],
         "context": [""]
        },
        {"tag": "options",
         "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered", "Need help please", "What else can you do?", "What can you help me with?", "What are you good at?", "How can you assist?", "How do you help?"],
         "responses": ["I can guide you through some cardiovascular diseases numbers and testings", "Offering support for cardiovascular diseases prediction."],
         "context": [""]
        },
        {"tag": "predict_disease",
         "patterns": ["How to check cardiovascular disease?", "Open cardiovascular disease prediction module", "Give me a prediction of my health state", "List all cardiovascular disease predictions with my data", "Do I have a cardiovascular disease?", "Can you do the testing for me?", "Open prediction module", "Can you predict if I had a heart disease?", "Commence prediction", "Let's predict if I had  cardiovascular disease"],
         "responses": ["I need you to provide some data first.", "I'd love to help, but you need to tell me more about yourself."],
          "context": ["predict_disease"]
        },
        {
          "tag": "definition",
          "patterns": ["What is cardiovascular disease", "What's the definition of cardiovascular disease", "Can you tell me the definition of cardiovascular disease", "What exactly is cardiovascular disease", "Wat does cardiovascular disease mean", "What is the meaning of cardiovascular disease", "Is heart disease and cardiovascular disease the same thing", "What is heart disease", "What is the definition of heart disease", "What does having cardiovascular disease mean"],
          "responses": ["Cardiovascular disease is the name for the group of disorders of heart and blood vessels, including heart attacks, high blood pressure, stroke, heart failure, etc."],
          "context": [""]
        },
        {"tag": "ask_symptoms",
         "patterns": ["What are the warning signs of cardiovascular disease?", "What are some of the signals of heart disease?", "What are the symptoms of cardiovascular disease?", "Do all cardiovascular diseases have the same symptoms?", "What are the common signs of cardiovascular disease?", "What are the early signs of heart disease?", "What are the symptoms of heart disease", "What are the frequently seen signals of cardiovascular disease", "Do you know the early signs of cardiovascular disease?", "Can you tell me the symptoms of cardiovascular disease?"],
         "responses": ["Early symptoms include pain or pressure in the chest, pain or discomfort in the arm, shortness of breath, nausea and fatigue, lightheadedness or dizziness, or cold sweat", "If you have cardiovascular disease, you might experience slight chest or arm pain, nausea, fatigue, shortness of breath or a cold sweat"],
         "context": [""]
        },
        {"tag": "ask_cause",
         "patterns": ["What is the most important risk factor for cardiovascular disease?", "What causes heart attacks?", "What is the cause of cardiovascular disease", "What are the common risk factors of cardiovascular disease", "What are the frequent causes of heart disease", "What are the common risk factors of cardiovascular disease", "What is cardiovascular disease caused by", "Which factors increase your chance of having cardiovascular disease", "Which risk factors have the highest chance of inflicting cardiovascular disease", "What are the risk factors of heart disease"],
         "responses": ["The ‘classical’ risk factors for cardiovascular disease include smoking, raised blood cholesterol, raised blood pressure, physical inactivity, obesity, and diabetes", "Cardiovascular disease is caused by frequent smoking, high blood pressure, high cholesterol level, high blood sugar, obesity and physical inactivity.", "The conventional risk factors include high cholesterol, high blood pressure, obesity, diabetes, and tobacco use or second hand smoke",
           "The likelihood of an individual developing cardiovascular disease is influenced by some factors such as genetic make‐up, gender, little exercise, overweight, high cholesterol and blood pressure",
           "The symptoms of cardiovascular disease include smoking, raised blood cholesterol, raised blood pressure, physical inactivity, obesity, and diabetes"],
         "context": [""]
        },
        {"tag": "ask_cure",
         "patterns": ["How can individuals reduce their risk of cardiovascular disease?", "What are some advice to reduce the risk of cardiovascular disease", "How do you prevent cardiovascular disease?", "What are the ways to reduce heart disease", "What are the natural treatments of cardiovascular disease", "What is the solution to cardiovascular problems", "What do I need to do to prevent cardiovascular disease", "Any advice to help prevent cardiovascular disease", "What are the ways to help prevent cardiovascular disease", "What are good methods to prevent heart disease"],
         "responses": ["Some of the detrimental effects can be counteracted by changes in behaviour, such as taking more exercise, stopping smoking, maintaining a healthy bodyweight, and eating a varied and well‐balanced diet.", " Heart attacks can be perceived as mild pain or discomfort, including pressure, squeezing, tightness, fullness or pain."],
         "context": [""]
        },
        {"tag": "gender_relation",
         "patterns": ["Is heart disease a man’s disease?", "Are men at greater risk of heart disease than women?", "Between men and women, which has a higher chance of having cardiovascular disease?", "Is cardiovascular disease gender related", "Does gender play any role in cardiovascular disease", "Are males more likely to ave cardiovascular disease than females", "What is the difference of gender ratio in cardiovascular disease", "Is it true that men is more likely to have cardiovascular disease", "Is women less likely to have heart disease than men", "Does gender matter in having cardiovascular disease"],
         "responses": ["Heart disease is far from being solely a man’s disease, but it is more common in men.", "Heart disease is more common in men than in women, but the prevalence increases with age in both sexes so that the difference reduces after the age of around 50–60 years", "Men are more likely to die from heart disease than women."],
         "context": [""]
        },
        {"tag": "exercise_relation",
         "patterns": ["How can weight loss reduce cardiovascular risk?", "Why is being physically active important in reducing cardiovascular disease risk?", "Why do I need to be fit in order to lessen my chance of having a heart disease?", "Can exercise really make your heart stronger?", "Is exercise a good cure for cardiovascular disease", "Is taking exercise good for people with cardiovascular disease", "Will people wit heart disease feel better by taking exercise", "Will exercise work in curing cardiovascular disease", "Is exercise a good solution for people with cardiovascular disease", "Do people with cardiovascular disease feel better by exercising"],
         "responses": ["Regular physical activity can reduce the risk of type 2 diabetes and cardiovascular disease by improving lipid levels, and lowering blood pressure.", "Studies of patients undergoing bariatric surgery demonstrate very clearly that weight loss reduces the risk of cardiovascular disease as well as type 2 diabetes and cancer"],
         "context": [""]
        },
        {"tag": "cholesterol_relation",
         "patterns": ["How is cholesterol linked with heart disease?", "What part does cholesterol play in coronary heart disease?", "Why is being obese a risk factor for cardiovascular disease?", "Does being overweight increase the risk of heart disease?", "Does cholesterol play a big part in cardiovascular disease", "Is being fat a cause of cardiovascular disease", "Is high cholesterol level a factor in causing cardiovascular disease", "Do people with high cholesterol level have a higher chance of getting heart disease", "Are people with high cholesterol level more likely to have cardiovascular disease", "What is the relation between cholesterol level and heart disease"],
         "responses": ["High cholesterol levels are associated with increased risk of heart disease and stroke.", "High levels of cholesterol may increase risk of heart disease, diabetes, or stroke.", "Being overweight increases the chance of having a heart attack."],
         "context": [""]
        },
        {"tag": "smoking_relation",
         "patterns": ["What's the link between smoking and heart disease?", "Is there any link between smoking and cardiovascular disease?", "Is heart disease more common among smokers?", "Is smoking a factor in causing cardiovascular disease", "What is the relation between smoking and cardiovascular disease", "Does frequent smoking cause cardiovascular disease", "Do smokers have a higher chance of having cardiovascular disease", "Is smoking a risk factor of cardiovascular disease", "Are smokers more likely to have cardiovascular disease", "Is smoking a threat to the heart"],
         "responses": ["Smoking is a major cause of atherosclerosis, a disease in which plaque builds up inside your arteries.", "the nicotine in smoke causes less oxygen to the heart, higher blood pressure and heart rate, more blood clotting and damage to cells that line coronary arteries and other blood vessels."],
         "context": [""]
        },
        {"tag": "alcohol_relation",
         "patterns": ["What cardiovascular diseases can alcohol cause?", "How can alcohol damage the cardiovascular system?", "Is there any relation between alcohol and heart disease?", "What are the cardiovascular risks associated with drinking alcohol?", "What is the relation between alcohol and cardiovascular disease", "Is alcohol a risk factor in cardiovascular disease", "Does alcohol play a part in cardiovascular disease", "Is drinking alcohol bad for the cardiovascular system", "Is consumption of alcoholic products a cause to cardiovascular disease", "Is there a connection between alcohol and heart disease"],
         "responses": ["In the long-term, drinking above the guidelines can lead to on-going increased heart rate, high blood pressure, weakened heart muscle and irregular heartbeat.", "Alcohol can cause heart attacks and strokes.", "Drinking too much alcohol can raise the levels of some fats in the blood (triglycerides). It can also lead to high blood pressure, heart failure and an increased calorie intake."],
         "context": [""]
        },
        {"tag": "child_growth_relation",
         "patterns": ["Is growth during childhood important in terms of cardiovascular disease risk?", "Are big and fat kids at greater risk of developing cardiovascular disease in later life?", "Are small babies more likely to have cardiovascular disease?", "Is there a connection between growth in childhood and cardiovascular disease", "Is childhood growth related to heart disease", "What is the relation between childhood growth and cardiovascular disease", "Would someone that was fat during their childhood have a higher chance of getting cardiovascular disease", "Is a big baby more likely to have cardiovascular disease in the future", "What sort of connection is there between childhood growth and heart disease", "Is growth during chilhood a contributing factor to developing cardiovascular disease"],
         "responses": ["Studies have consistently shown that children whose BMI increases relative to population growth curves (in other words, children who cross the centiles upwards) between the ages of about 5 and 18 years have an increased risk of developing high blood pressure, type 2 diabetes, and coronary heart disease in adult life.", "Adult body mass index (BMI) is positively related to birthweight, meaning a fatter baby is more likely to have some form of heart disease than a smaller one."],
         "context": [""]
        },
        {"tag": "lifestyle_relation",
         "patterns": ["Can stress cause heart disease?", "Are changes in lifestyle becoming less important as treatment for cardiovascular disease?", "Is lifestyle during adulthood important in causing cardiovascular disease?", "Is there a connection between stress and cardiovascular disease", "Is stress related to cardiovascular disease", "What is the relation between stress and cardiovascular disease", "What is the connection between lifestyle and heart disease", "Is lifestyle an important factor in causing or preventing cardiovascular disease", "Is a stressful life a risk factor of heart disease", "Would stress damage the cardiovascular system"],
         "responses": ["Cohort studies have shown that adult risk factors such as stress add to, and in some studies multiply, the effects of adverse early life exposures", "Encouraging changes to lifestyle can prevent heart disease without the side effects associated with surgery and drug therapy", "A stressful lifestyle can increase the risk of heart disease, although we still do not know how this happens."],
         "context": [""]
        },
        {"tag": "inflammation_relation",
         "patterns": ["What is the relation between inflammation and the risk of heart disease?", "What causes the type of inflammation associated with increased risk of heart disease?", "Can markers of inflammation be used to identify people at risk of heart disease?", "What is the connection between inflammation and cardiovascular disease", "Is there any connection between inflammation and cardiovascular disease", "What is the relation between inflammation and cardiovascular disease", "What danger to the cardiovascular system can inflammation cause", "Is there a relation between inflammation and heart disease", "Can inflammation be a sign of people having cardiovascular disease", "Do people with inflammation also have cardiovascular disease"],
         "responses": ["Researchers have found that people with high blood levels of C‐reactive protein, which indicates underlying levels of inflammation, are more likely to develop heart disease and stroke than those with lower levels of this protein.", "Some researchers suggests inflammatory cells are recruited to the sites of developing atherosclerotic plaques in response to deposits of cholesterol or oxidised lipid products on the artery wall.", "It has been suggested that prolonged inflammation of the arteries may be one of several factors that contribute to atherosclerosis (narrowing and hardening of the arteries)"],
         "context": [""]
        },
        {"tag": "inflammation_cure",
         "patterns": ["Can inflammation be reduced by drugs or diet?", "What can I do to reduce inflammation?", "Is reducing inflammation possible with proper treatment?", "What is the treatment to inflammation", "What is a way to cure inflammation", "How can I get rid of inflammation", "Can inflammation be cured with the appropriate treatment", "Can inflammation level be reduced with treatment", "Can you reduce inflammation with a proper diet or drugs", "Is inflammation curable"],
         "responses": ["There are a number of pharmacological agents available to reduce inflammation, but we need further research to predict their ability to reduce cardiovascular risk.", "Some aspects of the diet seem to influence the inflammatory response.", "Drug treatment to lower levels of inflammation has been shown to reduce the risk of heart disease"],
         "context": [""]
        },
        {"tag": "diet_nutrition_cure",
         "patterns": ["Do antioxidant nutrients reduce the risk of heart disease?", "Is it true that certain vegetables contain substances that might be good for the heart?", "What is so good about fruit and vegetables?", "Should we be focusing on healthy dietary patterns such as eating fruits and vegetables for reducing heart disease risk?", "What kind of nutrients cure cardiovascular disease", "What do I need to eat in order to reduce cardiovascular disease", "Which food has the nutrients to prevent cardiovascular disease", "What kind of diet is good for preventing heart disease", "Which are the nutrients I need in order to to prevent cardiovascular disease", "What sort of diet should I take in order to avoid heart disease"],
         "responses": ["There is a considerable body of evidence that has shown diets rich in fruit, vegetables, and other plant foods to be associated with a reduced risk of a number of diseases, including high blood pressure, obesity, heart disease, and stroke", "Fruit and vegetables collectively contain a wide range of nutrients, including vitamins with antioxidant properties, which are important to the body's immune system", "Free radical damage has been implicated as a factor in the development of heart disease and stroke, and a number of antioxidant nutrients found in fruits and vegetables are important in the body’s defence systems"],
         "context": [""]
        },
        {"tag": "drug_cure",
         "patterns": ["Are medicines a contributor to heart disease?", "Will taking drugs reduce the risk of heart disease?", "Will taking drugs like aspirin cure of heart disease?", "Are we able to prevent or cure heart disease with drugs?", "Will curing cardiovascular disease with common drugs work", "Can drugs cure cardiovascular disease", "Can I prevent cardiovascular disease with drugs?", "Which drugs work on people with cardiovascular disease", "What kind of drug is suitable for curing cardiovascular disease", "Are there any common drugs that treat heart disease"],
         "responses": ["Some drugs like aspirin may be helpful for patients who have already had a heart attack, stroke, atherosclerosis in other blood vessels, or who have diabetes or well-controlled hypertension.", "A number of highly effective drugs (such as lipid‐lowering agents, aspirin, ACE inhibitors, beta blockers, and other anti‐hypertensive drugs) have had a substantial impact on reducing cardiovascular disease mortality"],
         "context": [""]
        },
        {"tag": "exercise_length_cure",
         "patterns": ["How much physical activity should I be doing?", "How much exercise is needed?", "Do I need to exercise a lot?", "How long should I do my exercises to prevent heart disease", "How much time is enough for exercising", "How often should I exercise", "How long and how often should exercise be in order to be effective", "What is the average time of exercising to prevent cardiovascular disease", "What is the minimum amount of time needed for exercising in order to prevent heart disease", "Is exercising a lot really needed to prevent cardiovascular disease"],
         "responses": ["Undertaking 150 minutes of moderate intensity activity a week will limit risks of developing diseases such as heart disease and diabetes", " The right amount of exercise could be achieved by doing 30 minutes of activity, five days a week but could also be reached by doing shorter bouts of 10 minutes or more", "To gain real benefit, adults (including older adults) should take at least 150 minutes of moderate‐intensity aerobic activity a week."],
         "context": [""]
        },
        {"tag": "exercise_type_cure",
         "patterns": ["What types of activities count?", "What kind of exercise should I take?", "Is any type of activities okay or do I need to take specific exercise?", "What type of activities should I do", "What sort of exercise should I take", "Is there a specific type of exercise that is effective", "At what intensity do I need to be exercising at", "Does every type of exercise work in reducing the risk of heart disease", "Should I exercise lightly or intensely", "Does exercising need to be at an intense level"],
         "responses": ["All types of activity, provided they are of at least moderate intensity, contribute towards the 150 minutes a week and different types of physical activity benefit different body systems", "In general, any moderately intense activity, such as brisk walking, will do.", "Moderate exercises such as, but ot limited to, brisk walking, stair climbing or cycling are good enough to prevent cardiovascular diseases."],
         "context": [""]
        },
        {"tag": "alcohol_cure",
         "patterns": ["Is it true that some type of alcohol is good for your heart?", "Can something like red wine help prevent heart disease?", "Can alcohol have any benefits for your heart?", "Is there any alcoholic product that is good for your heart", "Can alcohol help prevent cardiovascular disease", "Is the myth of some alcoholic product having beneficial effects to the heart true", "Is there a chance of reducing cardiovascular risk by alcohol consumption", "Will drinking specific types of alcohol be good for you", "Can I stay healthy by drinking specific alcoholic products", "Would moderate use of alcohol have good effects on the heart"],
         "responses": ["Research has suggested that small amounts of alcohol may have a protective effect on your heart, but large intakes will have a detrimental effect.", "While alcohol’s anti-clotting ability might protect to a limited extent against heart attack, it may increase the risk of haemorrhagic stroke", "Any kind of alcohol-containing drink might have some cardiac benefit, but said benefit will be lost at high consumption."],
         "context": [""]
        }
]
}